<!DOCTYPE html>
<html lang="en">

<!-- Head tag -->
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="google-site-verification" content="xBT4GhYoi5qRD5tr338pgPM5OWHHIDR6mNg1a3euekI" />
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="description" content="">
    <meta name="keyword"  content="">
    <link rel="shortcut icon" href="/img/header.jpg">
    <!-- Place this tag in your head or just before your close body tag. -->
    <script async defer src="https://buttons.github.io/buttons.js"></script>
    <title>
        
          问诊 - Kurong
        
    </title>

    <link rel="canonical" href="https://chenwenling.cn/2023/11/18/dairy-03/">

    <!-- Bootstrap Core CSS -->
    
<link rel="stylesheet" href="/css/bootstrap.min.css">


    <!-- Custom CSS --> 
    
<link rel="stylesheet" href="/css/beantech.min.css">

    
    <!-- Pygments Highlight CSS -->
    
<link rel="stylesheet" href="/css/highlight.css">


    
<link rel="stylesheet" href="/css/widget.css">


    
<link rel="stylesheet" href="/css/rocket.css">


    
<link rel="stylesheet" href="/css/signature.css">


    <!-- 在其他CSS引用之后添加 -->
    
<link rel="stylesheet" href="/css/toc.css">

    
    <!-- 添加custom.css引用 -->
    
<link rel="stylesheet" href="/css/custom.css">


    <!-- Custom Fonts -->
    <!-- <link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.3.0/css/font-awesome.min.css" rel="stylesheet" type="text/css"> -->
    <!-- Hux change font-awesome CDN to qiniu -->
    <link href="https://cdn.staticfile.org/font-awesome/4.5.0/css/font-awesome.min.css" rel="stylesheet" type="text/css">


    <!-- Hux Delete, sad but pending in China
    <link href='http://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic' rel='stylesheet' type='text/css'>
    <link href='http://fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800' rel='stylesheet' type='text/
    css'>
    -->


    <!-- HTML5 Shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!-- WARNING: Respond.js doesn't work if you view the page via file:// -->
    <!--[if lt IE 9]>
        <script src="https://oss.maxcdn.com/libs/html5shiv/3.7.0/html5shiv.js"></script>
        <script src="https://oss.maxcdn.com/libs/respond.js/1.4.2/respond.min.js"></script>
    <![endif]-->

    <!-- ga & ba script hoook -->
    <script></script>
<meta name="generator" content="Hexo 7.3.0"><link rel="stylesheet" href="/assets/css/APlayer.min.css" class="aplayer-style-marker">
<script src="/assets/js/APlayer.min.js" class="aplayer-script-marker"></script>
</head>


<!-- hack iOS CSS :active style -->
<body ontouchstart="">
	<!-- Modified by Yu-Hsuan Yen -->
<!-- Post Header -->
<style type="text/css">
    header.intro-header{
        
            background-image: url('header.jpg')
            /*post*/
        
    }
    
</style>

<header class="intro-header" >
    <!-- Signature -->
    <div id="signature">
        <div class="container">
            <div class="row">
                <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                
                    <div class="post-heading">
                        <div class="tags">
                            
                              <a class="tag" href="/tags/#大固其其" title="大固其其">大固其其</a>
                            
                        </div>
                        <h1>问诊</h1>
                        <h2 class="subheading"></h2>
                        <span class="meta">
                            Posted by Kurong on
                            2023-11-18
                        </span>
                    </div>
                


                </div>
            </div>
        </div>
    </div>
</header>

	
    <!-- Navigation -->
<nav class="navbar navbar-default navbar-custom navbar-fixed-top">
    <div class="container-fluid">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">Kurong</a>
        </div>

        <!-- Collect the nav links, forms, and other content for toggling -->
        <!-- Known Issue, found by Hux:
            <nav>'s height woule be hold on by its content.
            so, when navbar scale out, the <nav> will cover tags.
            also mask any touch event of tags, unfortunately.
        -->
        <div id="huxblog_navbar">
            <div class="navbar-collapse">
                <ul class="nav navbar-nav navbar-right">
                    <li>
                        <a href="/">Home</a>
                    </li>

                    

                        
                    

                        
                        <li>
                            <a href="/about/">About</a>
                        </li>
                        
                    

                        
                        <li>
                            <a href="/archive/">Archives</a>
                        </li>
                        
                    

                        
                        <li>
                            <a href="/tags/">Tags</a>
                        </li>
                        
                    
                    
                </ul>
            </div>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>
<script>
    // Drop Bootstarp low-performance Navbar
    // Use customize navbar with high-quality material design animation
    // in high-perf jank-free CSS3 implementation
    var $body   = document.body;
    var $toggle = document.querySelector('.navbar-toggle');
    var $navbar = document.querySelector('#huxblog_navbar');
    var $collapse = document.querySelector('.navbar-collapse');

    $toggle.addEventListener('click', handleMagic)
    function handleMagic(e){
        if ($navbar.className.indexOf('in') > 0) {
        // CLOSE
            $navbar.className = " ";
            // wait until animation end.
            setTimeout(function(){
                // prevent frequently toggle
                if($navbar.className.indexOf('in') < 0) {
                    $collapse.style.height = "0px"
                }
            },400)
        }else{
        // OPEN
            $collapse.style.height = "auto"
            $navbar.className += " in";
        }
    }
</script>


    <!-- Main Content -->
    <!-- Modify by Yu-Hsuan Yen -->

<!-- Post Content -->
<article>
    <div class="container">
        <div class="row">

            <!-- Post Container -->
            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                post-container">

                
        <div id="aplayer-VEliGKUV" class="aplayer aplayer-tag-marker" style="margin-bottom: 20px;">
            <pre class="aplayer-lrc-content">[00:00.000]&#x4F5C;&#x8BCD; : &#x5C0F;&#x5BD2;
[00:01.000]&#x4F5C;&#x66F2; : &#x8521;&#x5065;&#x96C5;
[00:17.500]&#x9ED1;&#x591C;&#x7684;&#x989C;&#x8272;&#x3000;&#x80FD;&#x5426;&#x9ED1;&#x4E00;&#x70B9;
[00:26.600]&#x8BA9;&#x6CBF;&#x9014;&#x7684;&#x8857;&#x706F;&#x3000;&#x80FD;&#x6D6E;&#x73B0;
[00:35.110]&#x8FD9;&#x4E2A;&#x57CE;&#x5E02;&#x7684;&#x5B89;&#x9759;&#xA0;&#x80FD;&#x5426;&#x518D;&#x5B89;&#x9759;&#x4E00;&#x77AC;&#x95F4;
[00:43.690]&#x8BA9;&#x6211;&#x7684;&#x6C42;&#x6551;&#xA0;&#x518D;&#x5FAE;&#x5F31;&#x4F60;&#x90FD;&#x542C;&#x7684;&#x89C1;
[00:52.300]&#x4E3A;&#x4F55;&#x4E00;&#x5230;&#x9EC4;&#x660F;&#xA0;&#x5BC2;&#x5BDE;&#x597D;&#x6DF1;
[01:00.940]&#x906E;&#x4F4F;&#x56DE;&#x4F60;&#x6000;&#x91CC;&#x7684;&#x8DEF;&#x7A0B;
[01:10.140]&#x7B49;&#x4F60;&#x7684;&#x811A;&#x6B65;&#x58F0;&#x3000;&#x7ED9;&#x6211;&#x65B0;&#x751F;
[01:19.470]&#x6211;&#x7684;&#x591C;&#x76F2;&#x75C7;&#xA0;&#x5C31;&#x5FEB;&#x8981;&#x53D8;&#x6C38;&#x6052;
[01:47.300]&#x4EFB;&#x6027;&#x7684;&#x6CEA;&#x6C34;&#xA0;&#x82E5;&#x6D17;&#x51C0;&#x53CC;&#x773C;
[01:55.630]&#x6216;&#x8BB8;&#x54ED;&#x80FD;&#x6062;&#x590D;&#xA0;&#x6211;&#x89C6;&#x7EBF;
[02:03.810]&#x6162;&#x6761;&#x65AF;&#x91CC;&#x7684;&#x65F6;&#x95F4;&#xA0;&#x82E5;&#x80FD;&#x52A0;&#x901F;&#x5230;&#x8FBE;&#x660E;&#x5929;
[02:13.250]&#x6216;&#x8BB8;&#x6211;&#x7684;&#x4F60;&#xA0;&#x80FD;&#x63D0;&#x65E9;&#x4E9B;&#x89C1;&#x6211;&#x4E00;&#x9762;
[02:20.789]&#x4E3A;&#x4F55;&#x4E00;&#x5230;&#x9EC4;&#x660F;&#xA0;&#x5BC2;&#x5BDE;&#x597D;&#x6DF1;
[02:29.439]&#x906E;&#x4F4F;&#x56DE;&#x4F60;&#x6000;&#x91CC;&#x7684;&#x8DEF;&#x7A0B;
[02:38.669]&#x7B49;&#x4F60;&#x7684;&#x811A;&#x6B65;&#x58F0;&#x3000;&#x7ED9;&#x6211;&#x65B0;&#x751F;
[02:48.490]&#x6211;&#x7684;&#x591C;&#x76F2;&#x75C7;&#xA0;&#x5C31;&#x5FEB;&#x8981;&#x53D8;&#x6C38;&#x6052;
[02:59.849]&#x601D;&#x5FF5;&#x603B;&#x662F;&#x8BA9;&#x6211;&#x53D7;&#x56F0;&#xA0;&#x8131;&#x4E0D;&#x4E86;&#x8EAB;
[03:09.489]&#x6211;&#x6478;&#x9ED1;&#x627E;&#x4E0D;&#x5230;&#x56DE;&#x5BB6;&#x7684;&#x8DEF;&#x7A0B;
[03:17.290]&#x7B49;&#x5F85;&#x719F;&#x6089;&#x7684;&#x811A;&#x6B65;&#x58F0;&#x3000;&#x7ED9;&#x6211;&#x5FC3;&#x75BC;
[03:26.728]&#x6211;&#x7684;&#x591C;&#x76F2;&#x75C7;&#x3000;&#x624D;&#x4E0D;&#x4F1A;&#x53D8;&#x6C38;&#x6052;</pre>
        </div>
        <script>
          var ap = new APlayer({
            element: document.getElementById("aplayer-VEliGKUV"),
            narrow: false,
            autoplay: true,
            showlrc: 2,
            music: {
              title: "夜盲症",
              author: "徐佳莹",
              url: "夜盲症.mp3",
              pic: "/2023/11/18/dairy-03/夜盲症.jpg",
              lrc: "夜盲症.lrc"
            }
          });
          window.aplayers || (window.aplayers = []);
          window.aplayers.push(ap);
        </script>
<p>&#x5468;&#x4E09;&#x5348;&#x996D;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x73B0;&#x624B;&#x81C2;&#x80BF;&#x4E86;&#x4E00;&#x5757;&#xFF0C;&#x4E0A;&#x9762;&#x8FD8;&#x6D6E;&#x7740;&#x661F;&#x661F;&#x70B9;&#x70B9;&#x7684;&#x7EA2;&#x6591;&#xFF0C;&#x6211;&#x60F3;&#x53EF;&#x80FD;&#x662F;&#x88AB;&#x5947;&#x602A;&#x7684;&#x866B;&#x5B50;&#x54AC;&#x4E86;&#xFF0C;&#x53C8;&#x6216;&#x8005;&#x662F;&#x8001;&#x6BDB;&#x75C5;&#x8368;&#x9EBB;&#x75B9;&#xFF0C;&#x6CA1;&#x5F53;&#x56DE;&#x4E8B;&#xFF1B;&#x6CA1;&#x6210;&#x60F3;&#x4E0B;&#x5348;&#x7684;&#x65F6;&#x5019;&#x624B;&#x81C2;&#x75D2;&#x7684;&#x8D8A;&#x6F14;&#x6108;&#x70C8;&#xFF0C;&#x75BC;&#x5927;&#x6982;&#x8FD8;&#x80FD;&#x5FCD;&#x53D7;&#xFF0C;&#x75D2;&#x662F;&#x4E07;&#x4E07;&#x4E0D;&#x884C;&#x7684;&#x3002;&#x4F46;&#x6211;&#x62C5;&#x5FC3;&#x662F;&#x5FC3;&#x7406;&#x4F5C;&#x7528;&#xFF0C;&#x95EE;&#x95EE;&#x9694;&#x58C1;&#x7684;&#x540C;&#x4E8B;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x770B;&#x51FA;&#x6211;&#x7684;&#x624B;&#x81C2;&#x80BF;&#x4E86;&#xFF0C;&#x540C;&#x4E8B;&#x8FD8;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x4FDD;&#x6301;&#x6572;&#x952E;&#x76D8;&#x7684;&#x59FF;&#x52BF;&#x504F;&#x8FC7;&#x5934;&#x626B;&#x4E00;&#x773C;&#xFF0C;&#x5927;&#x60CA;&#x5931;&#x8272;&#xFF1A;&#x300C;&#x4F60;&#x8FD9;&#x4E5F;&#x80BF;&#x592A;&#x5927;&#x4E86;&#x5427;&#xFF01;&#x300D;&#x3002;&#x6211;&#x770B;&#x4E0D;&#x662F;&#x5FC3;&#x7406;&#x4F5C;&#x7528;&#xFF0C;&#x90A3;&#x8FD8;&#x662F;&#x53BB;&#x533B;&#x9662;&#x770B;&#x770B;&#xFF0C;&#x65F6;&#x95F4;&#x662F;&#x4E0B;&#x5348;4&#x70B9;&#x534A;&#xFF0C;&#x6211;&#x4F30;&#x7B97;&#x8FD8;&#x80FD;&#x5728;&#x533B;&#x9662;&#x4E0B;&#x73ED;&#x524D;&#x770B;&#x4E0A;&#x75C5;&#x5C31;&#x8D76;&#x7D27;&#x51FA;&#x53D1;&#x3002;</p>
<p>&#x8DDF;&#x7740;&#x5BFC;&#x822A;&#x51FA;&#x4E86;&#x5730;&#x94C1;&#x95F8;&#x95E8;&#xFF0C;&#x987A;&#x7740;&#x533B;&#x9662;&#x7684;&#x6307;&#x793A;&#x724C;&#x5F15;&#x5BFC;&#xFF0C;&#x4E00;&#x8DEF;&#x8D70;&#x5230;&#x4E00;&#x697C;&#x5927;&#x5385;&#xFF1B;&#x76D6;&#x6211;&#x65E5;&#x5E38;&#x9C9C;&#x5C11;&#x751F;&#x75C5;&#xFF0C;&#x5BF9;&#x533B;&#x9662;&#x6D41;&#x7A0B;&#x4E0D;&#x662F;&#x592A;&#x719F;&#xFF0C;&#x9760;&#x7740;&#x4E0D;&#x591A;&#x7684;&#x751F;&#x6D3B;&#x7ECF;&#x9A8C;&#x6211;&#x63A8;&#x6D4B;&#x5F97;&#x5148;&#x6302;&#x4E2A;&#x53F7;&#xFF0C;&#x8D70;&#x5230;&#x4E00;&#x6392;&#x7684;&#x6302;&#x53F7;&#x673A;&#x524D;&#xFF0C;&#x6211;&#x5BF9;&#x7740;&#x7433;&#x7405;&#x6EE1;&#x76EE;&#x7684;&#x75BE;&#x75C5;&#x5206;&#x7C7B;&#x72AF;&#x96BE;&#xFF1A;&#x300C;&#x90FD;&#x77E5;&#x9053;&#x662F;&#x4EC0;&#x4E48;&#x75C5;&#x8FD8;&#x6765;&#x533B;&#x9662;&#x5417;&#xFF1F;&#x300D;&#xFF0C;&#x786C;&#x7740;&#x5934;&#x76AE;&#x51C6;&#x5907;&#x5148;&#x9009;&#x4E2A;&#x76AE;&#x80A4;&#x79D1;&#x7684;&#x5927;&#x7C7B;&#xFF0C;&#x6B63;&#x62AC;&#x624B;&#x51C6;&#x5907;&#x70B9;&#x51FB;&#x5C4F;&#x5E55;&#x4E0A;&#x7684;&#x6309;&#x94AE;&#xFF0C;&#x7ED3;&#x679C;&#x6309;&#x94AE;&#x7A81;&#x7136;&#x53D8;&#x6210;&#x5DF2;&#x6309;&#x4E0B;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6211;&#x5927;&#x60CA;&#x5931;&#x8272;&#xFF0C;&#x5FC3;&#x60F3;&#x6211;&#x8FD9;&#x4E0D;&#x4EC5;&#x662F;&#x7F3A;&#x5C11;&#x533B;&#x5B66;&#x5E38;&#x8BC6;&#xFF0C;&#x5DF2;&#x7ECF;&#x66F4;&#x4E0D;&#x4E0A;&#x65F6;&#x4EE3;&#x4E86;&#x5417;&#xFF1F;&#x8FDE;&#x53D6;&#x53F7;&#x673A;&#x90FD;&#x5DF2;&#x7ECF;&#x8FDB;&#x5316;&#x5230;&#x624B;&#x52BF;&#x8BC6;&#x522B;&#x7684;&#x7A0B;&#x5EA6;&#x4E86;&#x3002;&#x6000;&#x7740;&#x5D07;&#x656C;&#x7684;&#x5FC3;&#x60C5;&#x7B49;&#x4E86;&#x4E00;&#x4F1A;&#x53D6;&#x53F7;&#x53E3;&#xFF0C;&#x673A;&#x5668;&#x6CA1;&#x6709;&#x4E00;&#x70B9;&#x8981;&#x5410;&#x51FA;&#x5355;&#x53F7;&#x7684;&#x610F;&#x601D;&#x3002;</p>
<p>&#x6211;&#xFF1A;&#x300C;&#xFF1F;&#x300D;</p>
<p>&#x788D;&#x4E8E;&#x533B;&#x9662;&#x4EBA;&#x6765;&#x4EBA;&#x5F80;&#xFF0C;&#x4E0D;&#x597D;&#x6548;&#x4EFF;&#x91CE;&#x6BD4;&#x7389;&#x5B50;&#x4ECE;&#x673A;&#x5668;1/5&#x5904;&#x6210;60&#xB0;&#x89D2;&#x6253;&#x4E0B;&#x53BB;&#xFF0C;&#x53EA;&#x597D;&#x518D;&#x6325;&#x4E00;&#x6B21;&#x624B;&#xFF0C;&#x8FD8;&#x662F;&#x6BEB;&#x65E0;&#x53CD;&#x5E94;&#xFF0C;&#x6211;&#x5C1D;&#x8BD5;&#x70B9;&#x4E86;&#x4E00;&#x6B21;&#x76AE;&#x80A4;&#x79D1;&#x7684;&#x6309;&#x94AE;&#xFF0C;&#x7ED3;&#x679C;&#x6B64;&#x6B21;&#x63D0;&#x793A;&#x5DF2;&#x4E0D;&#x5728;&#x6302;&#x53F7;&#x65F6;&#x95F4;&#x5185;&#x3002;&#x6211;&#x624D;&#x53D1;&#x73B0;&#x7855;&#x5927;&#x7684;&#x76AE;&#x80A4;&#x79D1;&#x4E09;&#x4E2A;&#x5B57;&#x4E0B;&#x9762;&#x6709;&#x4E00;&#x884C;&#x5C0F;&#x5982;&#x82CD;&#x8747;&#x7684;&#x5B57;&#xFF1A;&#x6302;&#x53F7;&#x65F6;&#x95F4;&#x622A;&#x81F3;17:00&#x3002;&#x539F;&#x6765;&#x521A;&#x521A;&#x6309;&#x94AE;&#x53EA;&#x662F;&#x53D8;&#x4E3A;&#x4E0D;&#x80FD;&#x70B9;&#x51FB;&#x7684;&#x72B6;&#x6001;&#x3002;&#x597D;&#x6D88;&#x606F;&#xFF0C;&#x521A;&#x521A;&#x4EE5;&#x4E3A;&#x88AB;&#x65F6;&#x4EE3;&#x629B;&#x5F03;&#x4E86;&#xFF0C;&#x7ED3;&#x679C;&#x65F6;&#x4EE3;&#x8F6C;&#x8EAB;&#x5B89;&#x6170;&#x4E86;&#x4E0B;&#x6211;&#x3002;</p>
<p>&#x95EE;&#x670D;&#x52A1;&#x7AD9;&#x7684;&#x62A4;&#x58EB;&#xFF0C;&#x6211;&#x8FD9;&#x60C5;&#x51B5;&#x8FD8;&#x80FD;&#x6302;&#x4EC0;&#x4E48;&#x53F7;&#x5417;&#xFF0C;&#x62A4;&#x58EB;&#x770B;&#x4E86;&#x4E0B;&#x65F6;&#x95F4;&#x8BF4;&#x8FD9;&#x4E2A;&#x70B9;&#x53EA;&#x6709;&#x6025;&#x8BCA;&#x8FD8;&#x63A5;&#x5F85;&#x4E86;&#x3002;&#x987A;&#x7740;&#x62A4;&#x58EB;&#x6307;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E00;&#x8DEF;&#x7684;&#x7F34;&#x8D39;&#x5904;&#x3001;&#x836F;&#x623F;&#x3001;&#x679C;&#x7136;&#x770B;&#x5230;&#x4E86;&#x6025;&#x8BCA;&#x6392;&#x961F;&#x5904;&#x3002;&#x8FD9;&#x4E00;&#x6E9C;&#x7684;&#x961F;&#x4F0D;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x5934;&#x624E;&#x7EF7;&#x5E26;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x88AB;&#x4EB2;&#x53CB;&#x6276;&#x7740;&#xFF0C;&#x53CC;&#x817F;&#x65E0;&#x529B;&#xFF0C;&#x8FD8;&#x6709;&#x7684;&#x4EBA;&#x770B;&#x7740;&#x9AA8;&#x6298;&#x4E86;&#xFF0C;&#x624B;&#x81C2;&#x8BE1;&#x5F02;&#x7684;&#x6B6A;&#x5411;&#x4E00;&#x8FB9;&#xFF0C;&#x7528;&#x4E34;&#x65F6;&#x7684;&#x786C;&#x677F;&#x56FA;&#x5B9A;&#x4E86;&#x4E00;&#x4E0B;&#x3002;&#x6211;&#x7AD9;&#x5728;&#x961F;&#x4F0D;&#x91CC;&#x663E;&#x5F97;&#x8FC7;&#x4E8E;&#x6B63;&#x5E38;&#x4E86;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x6392;&#x961F;&#x7684;&#x9EC4;&#x725B;&#x3002;</p>
<p>&#x5F88;&#x5FEB;&#x8F6E;&#x5230;&#x6211;&#x4E86;&#xFF0C;&#x6211;&#x5728;&#x9762;&#x524D;&#x7684;&#x6905;&#x5B50;&#x5750;&#x4E0B;&#xFF0C;&#x62A4;&#x58EB;&#x72D0;&#x7591;&#x7684;&#x626B;&#x4E86;&#x6211;&#x4E00;&#x773C;&#x8BF4;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;&#x6211;&#x64A9;&#x8D77;&#x8896;&#x5B50;&#xFF0C;&#x7ED9;&#x5979;&#x6307;&#x4E86;&#x4E0B;&#x7EA2;&#x6591;&#x5904;&#xFF0C;&#x5F3A;&#x8C03;&#x8368;&#x9EBB;&#x75B9;&#x662F;&#x5E38;&#x72AF;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x624B;&#x80BF;&#x662F;&#x524D;&#x6240;&#x672A;&#x6709;&#x7684;&#x3002;&#x62A4;&#x58EB;&#x6446;&#x6446;&#x624B;&#xFF0C;&#x8BA9;&#x6211;&#x91CF;&#x8840;&#x538B;&#xFF0C;&#x6211;&#x4E0D;&#x597D;&#x8D28;&#x7591;&#x76AE;&#x80A4;&#x75C5;&#x4E3A;&#x5565;&#x8981;&#x91CF;&#x8840;&#x538B;&#xFF0C;&#x4E56;&#x4E56;&#x7167;&#x505A;&#x540E;&#xFF0C;&#x628A;&#x8896;&#x5B50;&#x653E;&#x4E0B;&#xFF1B;&#x62A4;&#x58EB;&#x7ED9;&#x4E86;&#x6211;&#x4E00;&#x5F20;&#x5355;&#x5B50;&#xFF0C;&#x4E0A;&#x9762;&#x6807;&#x8BB0;&#x4E86;&#xFF1A;&#x6240;&#x5C5E;&#x79D1;&#x5BA4;&#x5916;&#x79D1;&#xFF0C;&#x8FD8;&#x6709;&#x5371;&#x9669;&#x7EA7;&#x6570;&#x2162;&#x3002;&#x6211;&#x8F6C;&#x7AD9;&#x7B49;&#x5019;&#x5BA4;&#xFF0C;&#x770B;&#x5230;&#x4E0A;&#x9762;&#x6807;&#x8BB0;&#x4E86;&#x6025;&#x8BCA;&#x5371;&#x9669;&#x7EA7;&#x6570;&#x4E00;&#x5171;&#x5206;&#x4E3A;&#x4E94;&#x7EA7;&#xFF0C;&#x6211;&#x7ADF;&#x7136;&#x4E0D;&#x662F;&#x6700;&#x4F4E;&#x7B49;&#x7EA7;&#xFF0C;&#x4E3A;&#x8368;&#x9EBB;&#x75B9;&#x9A84;&#x50B2;&#x3002;</p>
<p>&#x7B49;&#x4E86;&#x4E00;&#x4F1A;&#xFF0C;&#x770B;&#x5230;&#x6211;&#x7684;&#x53F7;&#x7801;&#x724C;&#x5DF2;&#x7ECF;&#x8DF3;&#x5230;&#x5F85;&#x53EB;&#x53F7;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x5C31;&#x5230;&#x5916;&#x79D1;&#x95E8;&#x53E3;&#x7B49;&#x7740;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x4E00;&#x4E2A;&#x5927;&#x53D4;&#x6342;&#x7740;&#x624B;&#x5FEB;&#x8D70;&#x4E86;&#x8FDB;&#x6765;&#xFF0C;&#x8840;&#x6C34;&#x6EF4;&#x4E86;&#x4E86;&#x4E00;&#x8DEF;&#xFF0C;&#x6211;&#x8D76;&#x7D27;&#x4FA7;&#x8EAB;&#x8BA9;&#x5F00;&#xFF0C;&#x5916;&#x79D1;&#x533B;&#x751F;&#x4E00;&#x526F;&#x89C1;&#x602A;&#x4E0D;&#x602A;&#x7684;&#x6837;&#x5B50;&#xFF1B;&#x8D77;&#x8EAB;&#x8D70;&#x8FC7;&#x6765;&#x8BA9;&#x5927;&#x53D4;&#x628A;&#x6342;&#x7740;&#x7684;&#x624B;&#x6253;&#x5F00;&#xFF0C;&#x6211;&#x597D;&#x5947;&#x7784;&#x4E86;&#x4E00;&#x773C;&#xFF0C;&#x770B;&#x5230;&#x4ED6;&#x624B;&#x4E0A;&#x7684;&#x76AE;&#x8089;&#x90FD;&#x7FFB;&#x4E86;&#x51FA;&#x6765;&#xFF1B;&#x533B;&#x751F;&#x9EBB;&#x5229;&#x7684;&#x5F00;&#x59CB;&#x6D88;&#x6BD2;&#x7F1D;&#x9488;&#xFF0C;&#x7ED3;&#x675F;&#x540E;&#x53EE;&#x5631;&#x5927;&#x53D4;&#x53BB;&#x6253;&#x4E00;&#x9488;&#x7834;&#x4F24;&#x98CE;&#xFF0C;1&#x5206;&#x949F;&#x4E0D;&#x5230;&#x5DF2;&#x7ECF;&#x89E3;&#x51B3;&#xFF0C;&#x8FD9;&#x6050;&#x6015;&#x662F;&#x5168;&#x4E16;&#x754C;&#x529E;&#x4E8B;&#x6548;&#x7387;&#x6700;&#x9AD8;&#x7684;&#x5730;&#x65B9;&#x3002;&#x4FDD;&#x6D01;&#x6E05;&#x7406;&#x597D;&#x5730;&#x9762;&#xFF0C;&#x6211;&#x56DE;&#x8FC7;&#x795E;&#x6765;&#xFF0C;&#x51C6;&#x5907;&#x5148;&#x628A;&#x8896;&#x5B50;&#x62C9;&#x8D77;&#x6765;&#x8282;&#x7701;&#x95EE;&#x8BCA;&#x65F6;&#x95F4;&#x3002;&#x4E00;&#x770B;&#x4E0D;&#x5F97;&#x4E86;&#xFF0C;&#x7EA2;&#x6591;&#x5DF2;&#x7ECF;&#x9000;&#x4E0B;&#x53BB;&#x5927;&#x534A;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x521A;&#x521A;&#x5413;&#x5F97;&#x5446;&#x82E5;&#x6728;&#x9E21;&#xFF0C;&#x8FDE;&#x75C5;&#x6BD2;&#x90FD;&#x552C;&#x4F4F;&#x4E86;&#x3002;&#x6211;&#x6015;&#x533B;&#x751F;&#x7B11;&#x6211;&#x6CA1;&#x75C5;&#x770B;&#x75C5;&#xFF0C;&#x7D27;&#x5F20;&#x7684;&#x80BE;&#x4E0A;&#x817A;&#x7D20;&#x5F00;&#x59CB;&#x4E0A;&#x5347;&#xFF0C;&#x8FD9;&#x4E48;&#x4E00;&#x7D27;&#x5F20;&#x7EA2;&#x6591;&#x53C8;&#x5192;&#x51FA;&#x6765;&#x4E00;&#x4E9B;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x6B63;&#x597D;&#x53EB;&#x5230;&#x6211;&#x4E86;&#xFF0C;&#x6211;&#x8D76;&#x7D27;&#x5750;&#x4E0B;&#xFF0C;&#x5C31;&#x6015;&#x518D;&#x665A;&#x70B9;&#x5C31;&#x81EA;&#x52A8;&#x75CA;&#x6108;&#x4E86;&#x3002;&#x533B;&#x751F;&#x770B;&#x6211;&#x5168;&#x987B;&#x5168;&#x5C3E;&#x7684;&#x95EE;&#x6211;&#x54EA;&#x4E0D;&#x8212;&#x670D;&#xFF1F;</p>
<p>&#x6211;&#x8131;&#x53E3;&#x800C;&#x51FA;&#xFF1A;&#x300C;&#x88AB;&#x868A;&#x5B50;&#x54AC;&#x4E86;&#xFF0C;&#x624B;&#x80BF;&#x4E86;&#x4E00;&#x5708;&#x3002;&#x300D;</p>
<p>&#x8BDD;&#x4E00;&#x51FA;&#x53E3;&#x5C31;&#x5F00;&#x59CB;&#x540E;&#x6094;&#xFF0C;&#x533B;&#x751F;&#x4E00;&#x8138;&#x7591;&#x60D1;&#x7684;&#x770B;&#x7740;&#x6211;&#xFF0C;&#x6211;&#x521A;&#x60F3;&#x6539;&#x53E3;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x533B;&#x751F;&#x970D;&#x7136;&#x8D77;&#x8EAB;&#xFF0C;&#x62FF;&#x8D77;&#x6211;&#x7684;&#x5355;&#x5B50;&#x5C31;&#x5411;&#x6025;&#x8BCA;&#x7AD9;&#x8D70;&#x53BB;&#xFF1A;&#x300C;&#x8FD9;&#x88AB;&#x871C;&#x8702;&#x86F0;&#x7684;&#x4EBA;&#x600E;&#x4E48;&#x5206;&#x5230;&#x5916;&#x79D1;&#x91CC;&#x9762;&#x6765;&#x4E86;&#x3002;&#x300D;</p>
<p>&#x6211;&#x7559;&#x5728;&#x79D1;&#x5BA4;&#x91CC;&#x9762;&#xFF0C;&#x5C1A;&#x672A;&#x660E;&#x767D;&#x77ED;&#x77ED;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x4FE1;&#x606F;&#x4F20;&#x64AD;&#x600E;&#x4E48;&#x80FD;&#x6709;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x7EB0;&#x6F0F;&#x3002;&#x533B;&#x751F;&#x62FF;&#x7740;&#x65B0;&#x7684;&#x5355;&#x5B50;&#x56DE;&#x6765;&#xFF0C;&#x8BF4;&#x662F;&#x62A4;&#x58EB;&#x5206;&#x9519;&#x4E86;&#x79D1;&#x5BA4;&#xFF0C;&#x8BA9;&#x6211;&#x53BB;&#x5185;&#x79D1;&#x518D;&#x95EE;&#x95EE;&#x3002;</p>
<p>&#x8F6C;&#x5230;&#x5185;&#x79D1;&#x95E8;&#x53E3;&#xFF0C;&#x6211;&#x770B;&#x7A97;&#x53E3;&#x7684;&#x5927;&#x5C4F;&#x5E55;&#x6EDA;&#x52A8;&#x7740;&#x4E0D;&#x5C11;&#x53F7;&#x7801;&#xFF0C;&#x53EF;&#x5185;&#x79D1;&#x95E8;&#x53E3;&#x7A7A;&#x65E0;&#x4E00;&#x4EBA;&#xFF0C;&#x6211;&#x6765;&#x56DE;&#x8E31;&#x4E86;&#x51E0;&#x6B65;&#xFF0C;&#x5438;&#x53D6;&#x521A;&#x521A;&#x5916;&#x79D1;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x6253;&#x597D;&#x8179;&#x7A3F;&#xFF0C;&#x8FDB;&#x53BB;&#x4E0D;&#x7B49;&#x533B;&#x751F;&#x53D1;&#x95EE;&#xFF0C;&#x4E00;&#x80A1;&#x8111;&#x8BB2;&#x5B8C;&#x75C7;&#x72B6;&#xFF0C;&#x518D;&#x719F;&#x7EC3;&#x7684;&#x6307;&#x51FA;&#x80BF;&#x8D77;&#x7684;&#x624B;&#x81C2;&#xFF0C;&#x533B;&#x751F;&#x70B9;&#x70B9;&#x5934;&#xFF0C;&#x5F00;&#x59CB;&#x5F00;&#x836F;&#xFF0C;&#x611F;&#x89C9;&#x53CC;&#x65B9;&#x5BF9;&#x521A;&#x521A;&#x5F7C;&#x6B64;&#x7684;&#x53D1;&#x6325;&#x90FD;&#x9887;&#x4E3A;&#x6EE1;&#x610F;&#x3002;&#x62FF;&#x597D;&#x75C5;&#x5386;&#x5355;&#xFF0C;&#x6211;&#x770B;&#x4E0A;&#x9762;&#x6D0B;&#x6D0B;&#x6D12;&#x6D12;&#x7684;&#x4E00;&#x9762;&#x72C2;&#x8349;&#xFF0C;&#x53EA;&#x80FD;&#x4F9D;&#x7A00;&#x8FA8;&#x8BA4;&#x51E0;&#x4E2A;&#x75D2;&#x3001;&#x80BF;&#xFF0C;&#x522B;&#x7684;&#x53EA;&#x662F;&#x4E00;&#x4E9B;&#x58A8;&#x6C34;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x533B;&#x751F;&#x548C;&#x853C;&#x7684;&#x5631;&#x5490;&#x6211;&#x53BB;&#x836F;&#x623F;&#x6293;&#x836F;&#x3002;</p>
<p>&#x8D70;&#x5230;&#x836F;&#x623F;&#x7684;&#x7A97;&#x53E3;&#xFF0C;&#x836F;&#x623F;&#x7684;&#x533B;&#x751F;&#x6B63;&#x5728;&#x7ED9;&#x836F;&#x76D2;&#x8D34;&#x6807;&#x7B7E;&#xFF0C;&#x6211;&#x8868;&#x660E;&#x6765;&#x610F;&#xFF0C;&#x533B;&#x751F;&#x4F38;&#x51FA;&#x4E00;&#x53EA;&#x60E8;&#x767D;&#x624B;&#x638C;&#xFF0C;</p>
<p>&#x6211;&#xFF1B;&#x300C;&#xFF1F;&#x300D;</p>
<p>&#x533B;&#x751F;&#x62AC;&#x5934;&#xFF1A;&#x201C;&#x75C5;&#x5386;&#x5361;&#x201D;&#x3002;</p>
<p>&#x6211;&#x8D76;&#x7D27;&#x628A;&#x75C5;&#x5386;&#x5361;&#x9012;&#x8FC7;&#x53BB;&#xFF0C;&#x533B;&#x751F;&#x770B;&#x4E86;&#x4E0B;&#x5361;&#xFF0C;&#x53C8;&#x770B;&#x770B;&#x6211;&#xFF0C;&#x628A;&#x624B;&#x91CC;&#x6446;&#x5F04;&#x7684;&#x836F;&#x76D2;&#x9012;&#x8FC7;&#x6765;</p>
<p>&#x6211;&#xFF1B;&#x300C;&#x2026;&#x300D;</p>
<p>&#x4E07;&#x4E07;&#x6CA1;&#x60F3;&#x5230;&#x5C31;&#x662F;&#x533B;&#x751F;&#x624B;&#x91CC;&#x8FD9;&#x76D2;&#xFF0C;&#x6211;&#x770B;&#x75C5;&#x5386;&#x5361;&#x662F;&#x4E4C;&#x9ED1;&#x4E00;&#x7247;&#xFF0C;&#x95EE;&#x53EA;&#x6709;&#x8FD9;&#x4E00;&#x76D2;&#x5417;&#xFF1F;&#x533B;&#x751F;&#x70B9;&#x70B9;&#x5934;&#xFF0C;&#x7EE7;&#x7EED;&#x4F4E;&#x5934;&#x8D34;&#x522B;&#x7684;&#x6807;&#x7B7E;&#x3002;&#x539F;&#x8DEF;&#x8FD4;&#x56DE;&#x5230;&#x5F00;&#x59CB;&#x7684;&#x4E00;&#x697C;&#x5927;&#x5385;&#xFF0C;&#x8DEF;&#x4E0A;&#x6709;&#x75C5;&#x7684;&#x5404;&#x5F0F;&#x5404;&#x6837;&#x7684;&#x60A3;&#x8005;&#x5728;&#x79FB;&#x52A8;&#x62C5;&#x67B6;&#x4E0A;&#x88AB;&#x63A8;&#x6765;&#x9001;&#x53BB;&#xFF0C;&#x6211;&#x6536;&#x597D;&#x836F;&#xFF0C;&#x5237;&#x5B8C;&#x533B;&#x4FDD;&#xFF0C;&#x4E58;&#x7740;&#x66AE;&#x8272;&#x79BB;&#x5F00;&#x533B;&#x9662;&#x3002;</p>

                

                <hr>
                <!-- Pager -->
                <ul class="pager">
                    
                        <li class="previous">
                            <a href="/2023/12/24/dairy-04/" data-toggle="tooltip" data-placement="top" title="2023年度歌曲盘点">&larr; Previous Post</a>
                        </li>
                    
                    
                        <li class="next">
                            <a href="/2023/10/29/dairy-02/" data-toggle="tooltip" data-placement="top" title="亚运游逛记录">Next Post &rarr;</a>
                        </li>
                    
                </ul>

                <!-- duoshuo Share start -->
                
                <!-- 多说 Share end-->

                <!-- 多说评论框 start -->
                
                <!-- 多说评论框 end -->

                <!-- disqus comment start -->
                
                    <div class="comment">
                        <div id="disqus_thread" class="disqus-thread"></div>
                    </div>
                
                <!-- disqus comment end -->
            </div>
            
            <!-- Tabe of Content -->
            <!-- Table of Contents -->

                
            <!-- Sidebar Container -->
            <div class="
                col-lg-8 col-lg-offset-2
                col-md-10 col-md-offset-1
                sidebar-container">

                <!-- Featured Tags -->
                
                <section>
                    <!-- no hr -->
                    <h5><a href="/tags/">FEATURED TAGS</a></h5>
                    <div class="tags">
                       
                          <a class="tag" href="/tags/#大固其其" title="大固其其">大固其其</a>
                        
                    </div>
                </section>
                

                <!-- Friends Blog -->
                
            </div>
        </div>
    </div>
</article>




<!-- disqus embedded js code start (one page only need to embed once) -->
<script type="text/javascript">
    /* * * CONFIGURATION VARIABLES * * */
    var disqus_shortname = "kurong00";
    var disqus_identifier = "https://chenwenling.cn/2023/11/18/dairy-03/";
    var disqus_url = "https://chenwenling.cn/2023/11/18/dairy-03/";

    (function() {
        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    })();
</script>
<!-- disqus embedded js code start end -->






    <!-- Footer -->
    <!-- Footer -->
<footer>
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
                <ul class="list-inline text-center">
                
                
                

                

                

                

                

                </ul>
                <p class="copyright text-muted">
                    Copyright &copy; Kurong 2026 
                    <br>
                </p>
            </div>
        </div>
    </div>
</footer>

<!-- jQuery -->

<script src="/js/jquery.min.js"></script>


<!-- Bootstrap Core JavaScript -->

<script src="/js/bootstrap.min.js"></script>


<!-- Custom Theme JavaScript -->

<script src="/js/hux-blog.min.js"></script>



<!-- async load function -->
<script>
    function async(u, c) {
      var d = document, t = 'script',
          o = d.createElement(t),
          s = d.getElementsByTagName(t)[0];
      o.src = u;
      if (c) { o.addEventListener('load', function (e) { c(null, e); }, false); }
      s.parentNode.insertBefore(o, s);
    }
</script>

<!-- 
     Because of the native support for backtick-style fenced code blocks 
     right within the Markdown is landed in Github Pages, 
     From V1.6, There is no need for Highlight.js, 
     so Huxblog drops it officially.

     - https://github.com/blog/2100-github-pages-now-faster-and-simpler-with-jekyll-3-0  
     - https://help.github.com/articles/creating-and-highlighting-code-blocks/    
-->
<!--
    <script>
        async("http://cdn.bootcss.com/highlight.js/8.6/highlight.min.js", function(){
            hljs.initHighlightingOnLoad();
        })
    </script>
    <link href="http://cdn.bootcss.com/highlight.js/8.6/styles/github.min.css" rel="stylesheet">
-->


<!-- jquery.tagcloud.js -->
<script>
    // only load tagcloud.js in tag.html
    if($('#tag_cloud').length !== 0){
        async("https://chenwenling.cn/js/jquery.tagcloud.js",function(){
            $.fn.tagcloud.defaults = {
                //size: {start: 1, end: 1, unit: 'em'},
                color: {start: '#bbbbee', end: '#0085a1'},
            };
            $('#tag_cloud a').tagcloud();
        })
    }
</script>

<!--fastClick.js -->
<script>
    async("https://cdn.bootcss.com/fastclick/1.0.6/fastclick.min.js", function(){
        var $nav = document.querySelector("nav");
        if($nav) FastClick.attach($nav);
    })
</script>


<!-- Google Analytics -->




<!-- Baidu Tongji -->



<!-- Live Photo Script: only load when page contains a live photo -->










	<a id="rocket" href="#top" class=""></a>
	<script type="text/javascript" src="/js/totop.js?v=1.0.0" async=""></script>
    <script type="text/javascript" src="/js/toc.js?v=1.0.0" async=""></script>
<!-- Image to hack wechat -->
<img src="https://chenwenling.cn/img/icon_wechat.png" width="0" height="0" />
<!-- Migrate from head to bottom, no longer block render and still work -->

</body>

</html>
